Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.ExactSpacing Class
 This class defines objects used in the exact spacing type.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.RebarSpacing.ExactSpacing
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class ExactSpacing
<SerializableAttribute>
Public Class ExactSpacing
The RebarSpacing.ExactSpacing type exposes the following members.
Constructors
Name | Description
RebarSpacing.ExactSpacing
Initializes a new instance of the RebarSpacing.ExactSpacing class
Top
See Also
Reference
Tekla.Structures.Model Namespace